{
    "Source": "Represents the source that will be used as a value for certain actions. It can be a Cell, a Column, a full Range, a Table or a Pivot Table.",
    "SourceSheet": "Represents the name of the sheet where the source is.",
    "Destination": "Represents the destination that will be modified by the action. It can be a Cell, a full Range, or a Column.",
    "DestinationPosition": "Represents the position of the modified destination. If the destination is a column, the position will usually be after or before another column. If the destination is a row, the position will be after or before a certain row number.",
    "NewDestination": "Exists as a tag if the destination will be newly created by the action, like the insert column action.",
    "DestinationSheet": "Represents the name of the sheet where the destination is.",
    "NewDestinationSheet": "Exists as a tag if the action will be creating a new sheet, like the create sheet action.",
    "HyperlinkName": "Represents the hyperlink URL that will be added in the Add Hyperlink action if one exists.",
    "HyperlinkExtension": "Represents the file extension of the hyperlink, if the hyperlink is a file.",
    "Key": "Represents the columns used as keys for sorting the source range during the Sort action. There can be multiple keys.",
    "Criteria": "Represents the criteria used to filter certain rows in the Filter action, there can be multiple criteria.",
    "Order": "Represents the order of sorting the source range during the sort action, whether ascending (A to Z) or descending (Z to A).",
    "Orientation": "Represents the orientation of the ordering in the sort action, whether row-oriented or column-oriented.",
    "Font": "Represents a font used for formatting a cell's value text.",
    "FontSize": "Represents a font size used for formatting a cell's value text.",
    "Color": "Represents a color used for formatting a cell's value text.",
    "FillColor": "Represents a color used for formatting a cell's background.",
    "Bold": "Exists as a tag if the action will be making the cell's value text bold.",
    "Italic": "Exists as a tag if the action will be making the cell's value text italic.",
    "Underline": "Exists as a tag if the action will be making the cell's value text underlined.",
    "HorizontalAlignment": "Represents the horizontal alignment of the cell's value text in the cell, whether center-aligned, left or right aligned, or justified.",
    "DataType": "Represents the cell value's data type.",
    "FormattingConditionType": "Represents the condition type used in conditional formatting.",
    "Formula": "Represents the Formulas and conditions used for conditional formatting.",
    "Name": "Represents the Name of the table, pivot table, or chart being created by the action.",
    "RowField": "Represents the columns that will be used in the row field of the pivot table.",
    "ColumnField": "Represents the columns that will be used in the column field of the pivot table.",
    "PageField": "Represents the columns that will be used in the filter field of the pivot table.",
    "DataField": "Represents the columns that will be used in the values field of the pivot table.",
    "Function": "Represents the function that will be used for the values in the values field of the pivot table.",
    "XField": "Represents the columns that will be used as the x-axis of the chart.",
    "YField": "Represents the columns that will be used as the y-axis of the chart.",
    "ChartTitle": "Represents the text that will be used as the title of the chart.",
    "ChartTitleBold": "Exists as a tag if the chart action will be making the chart's title text bold.",
    "ChartTrendlineType": "Represents the type of the chart's trendline.",
    "ChartTrendlineEquation": "Exists as a tag if the chart action will be showing the trendline's equation.",
    "ChartTrendlineRSquared": "Exists as a tag if the chart action will be showing the trendline's RSquared.",
    "ChartTrendlineField": "Represents the column in the YField that will be affected by the trendline action.",
    "ChartLegend": "Exists as a tag if the chart action will be showing the chart legend.",
    "ChartLegendPosition": "Represents the location of the chart's legend.",
    "ChartType": "Represents the type of the chart.",
    "ChartDataLabels": "Exists as a tag if the chart action will be showing the chart data labels.",
    "ChartMarkerStyle": "Represents the shape of the chart data markers.",
    "ChartMarkerSize": "Represents the size of the chart data markers.",
    "ChartMarkerField": "Represents the column in the YField that will be affected by the chart marker action.",
    "ChartXAxis": "Exists as a tag if the chart will be showing the X axis.",
    "ChartXAxisTitle": "Represents the text that will be used as the title of the chart's X axis.",
    "ChartXAxisLabelOrientation": "Represents the orientation of the chart X axis's label.",
    "ChartXAxisMaxScale": "Represents the maximum value of the X axis.",
    "ChartXAxisMinScale": "Represents the minimum value of the X axis.",
    "ChartYAxis": "Exists as a tag if the chart will be showing the Y axis.",
    "ChartYAxisTitle": "Represents the text that will be used as the title of the chart's Y axis.",
    "ChartYAxisLabelOrientation": "Represents the orientation of the chart Y axis's label.",
    "ChartYAxisMaxScale": "Represents the maximum value of the Y axis.",
    "ChartYAxisMinScale": "Represents the minimum value of the Y axis."
  }
  